Revit 2027 API
RebarShapeDefinition.SetParameterDefaultValue Method
 Change the parameter's value as stored in the definition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetParameterDefaultValue(
	ElementId paramId,
	double value
)
Public Sub SetParameterDefaultValue (
	paramId As ElementId,
	value As Double
)
public:
void SetParameterDefaultValue(
	ElementId^ paramId,
	double value
)
member SetParameterDefaultValue :
        paramId : ElementId *
        value : float -> unit
Parameters
paramId ElementId
 Id of a parameter in the definition.
value Double
 New value for the parameter.
Exceptions
Exception | Condition
ArgumentException |  This RebarShapeDefinition does not have a value for the parameter paramId.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace